import BanerImg from "../../../shared/libraryimg/BanerImg.png";
import './afishaBanner.scss'
export const AfishaBanner = () => {
    return (
        <div className='baner container  '>
            <h1>Обявление о мероприятиях</h1>
            <p>Библиотека имени Токтогула Сатылганова – это не только книги, но и активная работа по развитию культуры, образования и просвещения. Мы реализуем различные проекты, направленные на популяризацию чтения, поддержку молодежи, сохранение исторического наследия и развитие цифровых технологий.</p>


        </div>


    );
}

